### Revising the Select Query I

In [ ]:
select * from CITY where POPULATION>100000 and COUNTRYCODE='USA';

### Revising the Select Query II

In [ ]:
select NAME from CITY where POPULATION>120000 and COUNTRYCODE='USA';

### Select All

In [ ]:
select * from CITY;

### Select By ID

In [ ]:
select * from CITY where ID=1661;

### Japanese Cities' Attributes

In [ ]:
select * from CITY where COUNTRYCODE='JPN';

### Japanese Cities' Names

In [ ]:
select NAME from CITY where COUNTRYCODE='JPN';

### Weather Observation Station 1

In [ ]:
select CITY, STATE from STATION;

### Weather Observation Station 3

In [ ]:
select distinct CITY from STATION where mod(ID, 2) = 0; # mod in DB2

### Weather Observation Station 4

In [ ]:
select count(CITY)-count(distinct CITY) from STATION;

### Weather Observation Station 5

In [ ]:
select CITY, length(CITY) from STATION order by length(CITY) asc, CITY limit 1;
select CITY, length(CITY) from STATION order by length(CITY) desc, CITY limit 1;

### Weather Observation Station 6

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 7

In [ ]:
select distinct CITY from STATION where lower(right(CITY, 1)) in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 8

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) in ('a', 'e', 'i', 'o', 'u') and lower(right(CITY, 1)) in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 9

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 10

In [ ]:
select distinct CITY from STATION where lower(right(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 11

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u') or lower(right(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 12

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u') and lower(right(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Higher Than 75 Marks

In [ ]:
select NAME from STUDENTS where marks > 75 order by right(NAME, 3) asc, ID asc;

### Employee Names

In [ ]:
select NAME from EMPLOYEE order by NAME asc;

### Employee Salaries

In [ ]:
select NAME from EMPLOYEE where SALARY > 2000 and MONTHS < 10 order by EMPLOYEE_ID asc;

### Type of Triangle

In [ ]:
select case 
when A+B<=C or A+C<=B or B+C<=A then 'Not A Triangle'
when A=B and B=C and A=C then 'Equilateral'
when A=B or B=C or A=C then 'Isosceles'
else 'Scalene'
end
from TRIANGLES;

### The PADS

In [ ]:
select concat(concat(concat(NAME, '('), left(OCCUPATION, 1)), ')') from OCCUPATIONS order by NAME asc;

In [ ]:
select concat(concat(concat(concat('There are a total of ', count(OCCUPATION)), ' '), lower(OCCUPATION)),'s.') as N 
from OCCUPATIONS 
group by OCCUPATION 
order by N asc, OCCUPATION asc;

### Occupations

In [ ]:
# MySQL

WITH temp AS (
    SELECT *, ROW_NUMBER() OVER (PARTITION BY occupation ORDER BY name) AS row_num
    FROM Occupations
)

SELECT
    MAX(CASE WHEN occupation = 'Doctor' THEN name END) AS doctor,
    MAX(CASE WHEN occupation = 'Professor' THEN name END) AS professor,
    MAX(CASE WHEN occupation = 'Singer' THEN name END) As singer,
    MAX(CASE WHEN occupation = 'Actor' THEN name END) AS actor
FROM temp
GROUP BY row_num

In [ ]:
# MS SQL Server

WITH temp AS (
    SELECT ROW_NUMBER() OVER (PARTITION BY occupation ORDER BY name) AS row_num, *
    FROM Occupations
)

SELECT doctor, professor, singer, actor
FROM temp PIVOT (MAX(name) FOR occupation IN (Doctor, Professor, Singer, Actor)) AS pvt;

### Binary Tree Nodes

In [ ]:
select N, case 
when P is null then 'Root'
when (select count(*) from BST where P = t.N) > 0 then 'Inner'
else 'Leaf'
end
from BST t
order by N;

### New Companies

In [ ]:
select COMPANY_CODE, FOUNDER,
(select count(distinct LEAD_MANAGER_CODE) from LEAD_MANAGER where COMPANY_CODE = C.COMPANY_CODE),
(select count(distinct SENIOR_MANAGER_CODE) from SENIOR_MANAGER where COMPANY_CODE = C.COMPANY_CODE),
(select count(distinct MANAGER_CODE) from MANAGER where COMPANY_CODE = C.COMPANY_CODE),
(select count(distinct EMPLOYEE_CODE) from EMPLOYEE where COMPANY_CODE = C.COMPANY_CODE)
from COMPANY C
order by COMPANY_CODE;

### Revising Aggregations - The Count Function

In [ ]:
select count(NAME) from CITY where POPULATION > 100000;

### Revising Aggregations - The Sum Function

In [ ]:
select sum(POPULATION) from CITY where DISTRICT = 'California';

### Revising Aggregations - Averages

In [ ]:
select avg(POPULATION) from CITY where DISTRICT = 'California';

### Average Population

In [ ]:
select round(avg(POPULATION)) from (select distinct NAME, POPULATION from CITY);

### Japan Population

In [ ]:
select sum(POPULATION) from CITY where COUNTRYCODE = 'JPN';

### Population Density Difference

In [ ]:
select max(POPULATION)-min(POPULATION) from CITY;

### The Blunder

In [ ]:
select ceil(avg(SALARY) - avg(replace(SALARY, '0', ''))) from EMPLOYEES;

### Top Earners

In [ ]:
select max(MONTHS*SALARY), count(*)
from EMPLOYEE 
where MONTHS*SALARY = (select max(MONTHS*SALARY) from EMPLOYEE);

### Weather Observation Station 2

In [ ]:
select round(sum(LAT_N), 2), round(sum(LONG_W), 2) from STATION;

### Weather Observation Station 13

In [ ]:
select round(sum(LAT_N), 4) from STATION where LAT_N > 38.7880 and LAT_N < 137.2345;

### Weather Observation Station 14

In [ ]:
select round(max(LAT_N), 4) from STATION where LAT_N < 137.2345;

### Weather Observation Station 15

In [ ]:
select round(LONG_W, 4) from STATION where LAT_N = (select max(LAT_N) from STATION where LAT_N < 137.2345);

### Weather Observation Station 16

In [ ]:
select round(min(LAT_N), 4) from STATION where LAT_N > 38.7780;

### Weather Observation Station 17

In [ ]:
select round(LONG_W, 4) from STATION where LAT_N = (select min(LAT_N) from STATION where LAT_N > 38.7780);

### Weather Observation Station 18

In [ ]:
select round(abs(min(LAT_N) - max(LAT_N)) + abs(min(LONG_W) - max(LONG_W)), 4) from STATION;

### Weather Observation Station 19

In [ ]:
select round(sqrt(power(max(LAT_N)-min(LAT_N), 2)+power(max(LONG_W)-min(LONG_W), 2)), 4) from STATION;

### Weather Observation Station 20

In [ ]:
select round(LAT_N, 4)
from (select LAT_N, row_number() over (ORDER BY LAT_N) as ROWNU from STATION) as X
where ROWNU = (select round((count(LAT_N)+1)/2, 0) from STATION);

### Population Census

In [ ]:
select sum(CITY.POPULATION) 
from CITY 
inner join COUNTRY 
on CITY.COUNTRYCODE = COUNTRY.CODE
where COUNTRY.CONTINENT = 'Asia';

### African Cities

In [ ]:
select CITY.NAME 
from CITY
inner join COUNTRY
on CITY.COUNTRYCODE = COUNTRY.CODE
where COUNTRY.CONTINENT = 'Africa';

### Average Population of Each Continent

In [ ]:
select COUNTRY.CONTINENT, floor(avg(CITY.POPULATION))
from CITY
inner join COUNTRY
on CITY.COUNTRYCODE = COUNTRY.CODE
group by COUNTRY.CONTINENT;

### The Report

In [ ]:
select if(GRADES.GRADE>=8, STUDENTS.NAME, NULL), GRADES.GRADE, STUDENTS.MARKS
from STUDENTS, GRADES
where STUDENTS.MARKS between GRADES.MIN_MARK and GRADES.MAX_MARK
order by GRADES.GRADE desc, STUDENTS.NAME asc;

### Top Competitors

In [ ]:
select H.HACKER_ID, H.NAME
from HACKERS H
inner join SUBMISSIONS S
on H.HACKER_ID = S.HACKER_ID
inner join CHALLENGES C
on S.CHALLENGE_ID = C.CHALLENGE_ID
inner join DIFFICULTY D
on C.DIFFICULTY_LEVEL = D.DIFFICULTY_LEVEL
where S.SCORE = D.SCORE
group by H.HACKER_ID, H.NAME
having count(S.HACKER_ID) > 1
order by count(S.HACKER_ID) desc, S.HACKER_ID asc;

### Ollivander's Inventory

In [ ]:
select W.ID, WP.AGE, W.COINS_NEEDED, W.POWER
from WANDS W
join WANDS_PROPERTY WP
on W.CODE = WP.CODE
where WP.IS_EVIL = 0 and W.COINS_NEEDED = (select min(COINS_NEEDED) 
                                           from WANDS A
                                           join WANDS_PROPERTY B
                                           on A.CODE = B.CODE
                                           where A.POWER = W.POWER and B.AGE = WP.AGE)
order by W.POWER desc, WP.AGE desc;

### Challenges

In [ ]:
select H.HACKER_ID, H.NAME, count(C.CHALLENGE_ID) CC
from HACKERS H
join CHALLENGES C 
on C.HACKER_ID = H.HACKER_ID
group by H.HACKER_ID, H.NAME
having CC = 
    (select COUNT(C2.CHALLENGE_ID) CC2
     from CHALLENGES C2
     group by C2.HACKER_ID 
     order by CC2 desc limit 1)
or CC in 
    (select distinct CC3
     from (select H2.HACKER_ID, H2.NAME, count(CHALLENGE_ID) CC3
           from HACKERS H2
           join CHALLENGES C 
           on C.HACKER_ID = H2.HACKER_ID
           group by H2.HACKER_ID, H2.NAME) CCOUNTS
     group by CC3
     having count(CC3) = 1)
order by CC desc, H.HACKER_ID;

### Contest Leaderboard

In [ ]:
select MAX_SCORE.HACKER_ID, 
       (select H.NAME 
        from HACKERS H
        where H.HACKER_ID = MAX_SCORE.HACKER_ID) NAME, 
       sum(MAX_SCORE.SCORE) TOTAL_SCORE 
from (select HACKER_ID, max(SCORE) SCORE 
      from SUBMISSIONS S
      group by 1, S.CHALLENGE_ID) MAX_SCORE 
group by 1
having TOTAL_SCORE > 0
order by TOTAL_SCORE DESC, HACKER_ID;

### SQL Project Planning

In [ ]:
select START_DATE, X 
from (select A.START_DATE, min(B.END_DATE) X
      from (select START_DATE 
            from PROJECTS 
            where START_DATE not in (select END_DATE from PROJECTS)) A,
           (select END_DATE
            from PROJECTS
            where END_DATE not in (select START_DATE from PROJECTS)) B
      where START_DATE < END_DATE
      group by A.START_DATE) P
order by datediff(X, START_DATE), START_DATE;

### Placements

In [ ]:
select S.NAME
from STUDENTS S
join FRIENDS F
on S.ID = F.ID
join PACKAGES P1
on S.ID = P1.ID
join PACKAGES P2
on F.FRIEND_ID = P2.ID
where P2.SALARY > P1.SALARY
order by P2.SALARY asc;

### Symmetric Pairs

In [ ]:
select X, Y
from FUNCTIONS F1
where exists(select * 
             from FUNCTIONS F2 
             where F2.Y = F1.X and F2.X = F1.Y and F2.X > F1.X) and (X != Y)
union
select X, Y 
from FUNCTIONS F1 
where X = Y and ((select count(*) from FUNCTIONS where X = F1.X and Y = F1.X) > 1)
order by X;

### Interviews

In [ ]:
select CON.CONTEST_ID, CON.HACKER_ID, CON.NAME,
       sum(TOTAL_SUBMISSIONS) TOTAL_SUBMISSIONS,
       sum(TOTAL_ACCEPTED_SUBMISSIONS) TOTAL_ACCEPTED_SUBMISSIONS,
       sum(TOTAL_VIEWS) TOTAL_VIEWS,
       sum(TOTAL_UNIQUE_VIEWS) TOTAL_UNIQUE_VIEWS
from CONTESTS CON
left join COLLEGES COL
    on CON.CONTEST_ID = COL.CONTEST_ID
left join CHALLENGES CHA
    on COL.COLLEGE_ID = CHA.COLLEGE_ID
left join (select CHALLENGE_ID, 
                  sum(TOTAL_VIEWS) TOTAL_VIEWS,
                  sum(TOTAL_UNIQUE_VIEWS) TOTAL_UNIQUE_VIEWS
           from VIEW_STATS
           group by CHALLENGE_ID) VST
    on CHA.CHALLENGE_ID = VST.CHALLENGE_ID
left join (select CHALLENGE_ID, 
                  SUM(TOTAL_SUBMISSIONS) TOTAL_SUBMISSIONS, 
                  SUM(TOTAL_ACCEPTED_SUBMISSIONS) TOTAL_ACCEPTED_SUBMISSIONS
           from SUBMISSION_STATS
           group by CHALLENGE_ID) SST
    on CHA.CHALLENGE_ID = SST.CHALLENGE_ID
group by CON.CONTEST_ID, CON.HACKER_ID, CON.NAME
having (TOTAL_SUBMISSIONS + TOTAL_ACCEPTED_SUBMISSIONS + TOTAL_VIEWS + TOTAL_UNIQUE_VIEWS) > 0
order by CON.CONTEST_ID;

### 15 Days of Learning SQL

In [ ]:
select SUBMISSION_DATE,
       (select count(distinct HACKER_ID)
        from SUBMISSIONS S2
        where S2.SUBMISSION_DATE = S1.SUBMISSION_DATE and 
             (select count(distinct S3.SUBMISSION_DATE)
              from SUBMISSIONS S3 
              where S3.HACKER_ID = S2.HACKER_ID and S3.SUBMISSION_DATE < S1.SUBMISSION_DATE) =
                    datediff(S1.SUBMISSION_DATE , '2016-03-01')),
       (select HACKER_ID 
        from SUBMISSIONS S2 
        where S2.SUBMISSION_DATE = S1.SUBMISSION_DATE 
        group by HACKER_ID 
        order by count(SUBMISSION_ID) desc, HACKER_ID LIMIT 1) as TMP,
       (select NAME 
        from HACKERS 
        where HACKER_ID = TMP)
from (select distinct SUBMISSION_DATE 
      from SUBMISSIONS) S1
group by SUBMISSION_DATE;

### Draw The Triangle 1

In [ ]:
set @NUMBER = 21;
select repeat('* ', @NUMBER := @NUMBER - 1)
from information_schema.tables limit 20;

### Draw The Triangle 2

In [ ]:
set @NUMBER = 0;
select repeat('* ', @NUMBER := @NUMBER + 1)
from information_schema.tables limit 20;

### Print Prime Numbers

In [ ]:
select group_concat(NUMB separator '&')
from (
    select @num:=@num+1 NUMB
    from information_schema.tables t1,
         information_schema.tables t2,
    (select @num:=1) tmp
     ) tempNum
where NUMB<=1000 and not exists(select * 
                                from (select @nu:=@nu+1 as NUMA 
                                      from information_schema.tables t1,
                                           information_schema.tables t2,
                                          (SELECT @nu:=1) tmp1
                                      limit 1000) A
                                where floor(NUMB/NUMA)=(NUMB/NUMA) and NUMA<NUMB and NUMA>1);